tap "dagger/tap"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "ngrok/ngrok"
# Run your GitHub Actions locally
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Replace zsh completion selection menu with fzf
brew "fzf-tab"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Postgres C API library
brew "libpq"
# Fully functional local AWS cloud stack
brew "localstack"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Remote terminal application
brew "mosh"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Libraries for security-enabled client and server applications
brew "nss"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@18", link: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Rust toolchain installer
brew "rustup"
# Cross-shell prompt for astronauts
brew "starship"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Agent orchestration platform
cask "antigravity"
# Desktop password and login vault
cask "bitwarden"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Group chat software
cask "chatwork"
# Anthropic's official Claude AI desktop app
cask "claude"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Containerized environments for coding agents
cask "dagger/tap/container-use"
# AI-powered translator
cask "deepl"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-cica"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# MySQL/MariaDB database management
cask "sequel-ace"
# Team communication and collaboration software
cask "slack"
# View Spaces / Virtual Desktops in the menu bar
cask "spaceman"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
cargo "zellij"
npm "@dotenvx/dotenvx"
npm "playwright"
npm "portless"
npm "tsx"
