tap "dagger/tap"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "ngrok/ngrok"
# Run your GitHub Actions locally
brew "act"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fully functional local AWS cloud stack
brew "localstack"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Open source relational database management system
brew "mysql-client"
# Libraries for security-enabled client and server applications
brew "nss"
# Fast, disk space efficient package manager
brew "pnpm"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Terraform
brew "hashicorp/tap/terraform"
# AI Coding Agent IDE
cask "antigravity"
# Desktop password and login vault
cask "bitwarden"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Group chat software
cask "chatwork"
# Anthropic's official Claude AI desktop app
cask "claude"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Containerized environments for coding agents
cask "container-use"
# Write, edit, and chat about your code with AI
cask "cursor"
# Universal database tool and SQL client
cask "dbeaver-community"
# AI-powered translator
cask "deepl"
# App to build and share containerised applications and microservices
cask "docker-desktop"
cask "font-cica"
cask "font-hackgen"
cask "font-hackgen-nerd"
cask "font-jetbrains-mono-nerd-font"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Video communication and virtual meeting platform
cask "zoom"
vscode "adpyke.vscode-sql-formatter"
vscode "ahmadalli.vscode-nginx-conf"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "bierner.markdown-mermaid"
vscode "biomejs.biome"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codingyu.laravel-goto-view"
vscode "cognition.devin"
vscode "csstools.postcss"
vscode "eamodio.gitlens"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "ibm.output-colorizer"
vscode "jackiotyu.git-worktree-manager"
vscode "mechatroner.rainbow-csv"
vscode "medo64.render-crlf"
vscode "mikestead.dotenv"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "neilbrayfield.php-docblocker"
vscode "nuxt.mdc"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel5-snippets"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "ryannaddy.laravel-artisan"
vscode "sanderronde.phpstan-vscode"
vscode "shufo.vscode-blade-formatter"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "xdebug.php-debug"
vscode "yzhang.markdown-all-in-one"
